/*关于常量

基本类型数据
              整数(变量只能存放(是)实数)
                  整型      -- int          
                  短整型    -- short int
                  长整型    -- long  int
              
              实数(浮点数) 
                  单精度    -- float
                  双精度    -- double        
                   float c = 3.2 就是传统的表示方法
                   float c = 3.2e3表示科学计数法(e表示的是十,代表3.2*10的三次方即3200)  
                   e.g:          float d = 1783.45e-2  表示为17.8345(负号表示为除)  
              字符
                  单个字符用单引号'S'
                  字符串用双引号 "SB"(欸嘿,偷偷骂你一下)
                  另外"A"也是正确的表示方式表示'A'与'\0'的组合,即字符串"A\0"
                  所有字符串默认添加\0
*/

/*复合类型数据(将基本型数据结合构成) 


*/  


/*变量
    变量的本质就是内存的一段存储空间 
        软件运行时会向操作系统申请内存空间
        变量 会与 内存的单元一一对应
    变量为什么要初始化
        初始化就是赋值的意思,一定要给变量赋值,可以开头也可以在后续代码中进行 
如何写变量
    数据类型 变量名=所赋的赋值
    另外变量不可以定义两次
    请看其下

*/ 
# include <stdio.h>
int char ch = 'A'

int char ch = 'a'//错误

/*
而另一种却是正确的*/
int char ab = 'A'

ab = 'C'//表示变量第一次被赋值为A,后又被赋值为C. 瓦卡卢?(懂了吗?)
//最终输出就是C,同理
# include <stdio.h> 
int char ch = 'A'

ch = 'C'
ch = 'D'

//最终输出则是D


/*什么是进制
     进制就是逢几进几

      %d是十进制输出
      %x或者%X表示十六进制输出
      %o表示八进制输出
*/


/*常量以什么样的二进制代码存储在计算机当中




  以ASCII表示
A    👉      某个数   👉   某个码
          字符的本质是以整数形式存储(该知识不必认识太深,了解即可)

*/




/*代码规范化
林锐--<高质量C/C++>
成对敲代码例:()   而非先( 然后****  再)
多空格
多注释
同类代码不缩进 内部代码需缩进
独立代码需换行
标注  标注时间  10点11分
      目的:
      功能:
    /*在Vc++2022中输出的结果:
    ---------------------







    ---------------------
    */
# include <stdio.h>//此为举例
int main(void)
{
    if (ad(dawd(dad)))
    {
        if (daw)
        {
            while (dadaw(dwa))
            {


            }
        }
        //以上代码需要缩进!!!!
                
    
    
    }



    return 0;
}
/*什么是字节
字节就是存储数据的单位,并且是硬件(cpu)所能访问的最小的单位
一个字节 = 8位
1K = 1024字节
1M = 1024K
1G = 1024M
问题;为什么电脑买回来有1T 但是实际显示却只有900G左右  
因为卖电脑的以100 1000 计算 
而计算机实际是1024 计算上位
*/


/*不同类型数据之间相互赋值的问题
*/
int i = 45
long j = 10324
i = j→可以相互赋值的变量

char = 'A'→字符

"AJ"→字符串//字符与字符串无法相互赋值!




/*什么是ASCII
ASCII不是一个值,是一个规则
规定不同字符(字符形式多样,可以是数字,可以是字母)以什么整数值表示
建议:此处新建源代码测试不同字符的对应的整数


 */
//如下
# include <stdio.h>

int main(void)
{
    char ch = 'b';

    printf("%d\n", ch);
    
    return 0;
}


//故而字符(char = ""/'')与整数(int = ...)的存储方式相同


/*printf()→输出
其含义是将变量输出到显示器
      四种用法
        1.printf("字符串\n") \n表示换行,是转义字符
        2.printf("输出控制符",输出参数 ← 即某个变量的赋值)看e.g1
        3.printf("输出控制符1 输出控制符2",参数1,参数2)→输出控制符与输出参数必须一一对应
        4.printf("输出控制符 非输出控制符",输出参数)
        输出控制符              ↓
        %d                  即语言表达
        %ld
        %x或者%X
        %#x或者%#X
        %c
        %f
        %lf
        %s → 字符串
      输出控制符的存在是二进制代码精准表达数据,是数据能表示各种格式(.MP4.MP3等等),以实现电影,音乐等等功能
      以不同输出格式则存在不同输出结果,所以会存在输出控制符



scanf()→输入
      用法
        1.scanf("输入控制符",输入参数);详看e.g2;PS:此时只需输入任意输入参数即可
        
        2.scanf("非输入控制符 输入控罪符",输入参数);PS:此时需要输入非输入控制符加上输入参数

        若想同时对多个变量进行输入参数,与输出方式一致,且需要输入取地址符号
        输入参数时,需要先输入第一个参数空格或回车键后再输入第二个参数此时程序会正常进行
        写输入时不要换行即\n

        3.对非法代码需要必要处理 



*/


//e.g1
// :
# include <stdio.h>    

int main(void)
{
    int i = 10;//虽然赋值是10,但是放入计算机是二进制代码,故而输出是需要指定进制

    printf("%d\n", i);//d表示十进制

    return 0;
}

//e.g2:
# include <stdio.h>

int main(void)
{
    int i;
    scanf(" % d, &i");//&i表示i的地址,&表示取地址符,此步骤表示键盘输入某个,或多个字符,并以将字符赋给该变量
    printf("i = %d\n", i);
    

    return 0; 
}

/*运算符:
     算术 
          +    -    *    /    %
     关系运算符
          >    >=   <    <=   !=    ==
     逻辑运算符
          !    &&(并且)  ||(或)
     赋值运算符
          =    +=   *=    /=   -=
     优先级别
          算术 > 关系 > 逻辑 > 赋值
*/

/*
C语言对真假的处理
     非零是真
     零是假

     真是1表示
     假是0表示


*/


/*

*/
