/*
数据结构概述
        定义
            我们如何把现实中大量而复杂的问题以特定的数据类型和特定的
            存储结构保存到主存储器,即内存中;//这就是数据结构
            数据结构 = 个体 + 个体间关系

            以及在此基础上为实现某个功能,
            如查找某个元素,删除某个元素,对某个元素进行排序,而进行的操作,
            //这个操作就是算法
            算法 = 对存储数据的操作
            
            以及// 程序 = 数据结构 + 算法
        
        算法
            解题的方法和步骤

            衡量算法的标准
                1   时间复杂度
                      大概程序要执行的次数,但不是执行的时间
                2   空间复杂度
                      算法执行过程中大概所占用的最大内存
                3   难易程度

                4   健壮性
        数据结构的地位
            数据结构是软件中最核心的课程
            
*/